; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v8)
             (pred_9 ?v4 ?v7)
             (pred_11 ?v5 ?v7)
             (pred_10 ?v3 ?v5 )
	     (pred_1 ?v5)
             (pred_7 ?v11)
             (pred_2 ?v4)
             (pred_4 ?v7)
             (pred_12 ?v5)
             (pred_5 ?v4)
             (pred_3 ?v5)
             (pred_8 ))



(:action op_4
:parameters (?v9 ?v10 ?v1 ?v2)
:precondition (and (pred_7 ?v9) (pred_7 ?v10) (pred_2 ?v1) (pred_4 ?v2)
          (pred_6 ?v9 ?v10) (pred_9 ?v1 ?v2)
                   (pred_11 ?v10 ?v2) (pred_1 ?v9) 
                   (pred_12 ?v10) (pred_5 ?v1))
:effect (and  (pred_3 ?v10) (not (pred_12 ?v10))))


(:action op_5
:parameters (?v9 ?v6)
:precondition (and (pred_7 ?v9) (pred_7 ?v6)
               (pred_1 ?v9) (pred_6 ?v9 ?v6) (pred_3 ?v6))
:effect (and (pred_1 ?v6) (not (pred_1 ?v9))))

(:action op_1
:parameters (?v9 ?v1)
:precondition (and (pred_7 ?v9) (pred_2 ?v1) 
                  (pred_1 ?v9) (pred_10 ?v1 ?v9) (pred_8 ))
:effect (and (pred_5 ?v1)
   (not (pred_10 ?v1 ?v9)) (not (pred_8 ))))


(:action op_3
:parameters (?v9 ?v12 ?v13)
:precondition (and (pred_7 ?v9) (pred_2 ?v12) (pred_2 ?v13)
                  (pred_1 ?v9) (pred_5 ?v13) (pred_10 ?v12 ?v9))
:effect (and (pred_5 ?v12) (pred_10 ?v13 ?v9)
        (not (pred_5 ?v13)) (not (pred_10 ?v12 ?v9))))

(:action op_2
:parameters (?v9 ?v1)
:precondition (and (pred_7 ?v9) (pred_2 ?v1) 
                  (pred_1 ?v9) (pred_5 ?v1))
:effect (and (pred_8 ) (pred_10 ?v1 ?v9) (not (pred_5 ?v1)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_13 obj_12 obj_15 obj_05 obj_21 obj_08 obj_19 obj_10 obj_17 obj_06 obj_16 obj_22 obj_18 obj_20 obj_01 obj_04
    obj_09 obj_02 obj_07
    obj_14 obj_03 obj_11
    )

    (:init
       (pred_8)

       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_15)
       (pred_7 obj_05)
       (pred_7 obj_21)
       (pred_7 obj_08)
       (pred_7 obj_19)
       (pred_7 obj_10)
       (pred_7 obj_17)
       (pred_7 obj_06)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_18)
       (pred_7 obj_20)
       (pred_7 obj_01)
       (pred_7 obj_04)
       (pred_4 obj_09)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_2 obj_14)
       (pred_2 obj_03)
       (pred_2 obj_11)

       (pred_6 obj_13 obj_21)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_12 obj_15)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_15 obj_19)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_15 obj_12)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_21 obj_17)
       (pred_6 obj_21 obj_08)
       (pred_6 obj_21 obj_13)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_12)
       (pred_6 obj_08 obj_21)
       (pred_6 obj_19 obj_16)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_19 obj_15)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_06)
       (pred_6 obj_17 obj_21)
       (pred_6 obj_06 obj_20)
       (pred_6 obj_06 obj_16)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_17)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_22)
       (pred_6 obj_16 obj_19)
       (pred_6 obj_16 obj_06)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_22 obj_10)
       (pred_6 obj_22 obj_16)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_20 obj_01)
       (pred_6 obj_20 obj_06)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_01 obj_20)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_01)
       (pred_12 obj_20)
       (pred_12 obj_22)
       (pred_12 obj_13)
       (pred_11  obj_20 obj_09)
       (pred_11  obj_22 obj_02)
       (pred_11  obj_13 obj_07)
       (pred_3 obj_12)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_08)
       (pred_3 obj_19)
       (pred_3 obj_10)
       (pred_3 obj_17)
       (pred_3 obj_06)
       (pred_3 obj_16)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_3 obj_04)

       (pred_9  obj_14 obj_09)
       (pred_9  obj_03 obj_02)
       (pred_9  obj_11 obj_07)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_11 obj_08)
       (pred_1 obj_06)
    )

    (:goal (and
       (pred_10 obj_11 obj_01)
    ))
(:constraints
  (always (not (pred_1 obj_19)))
)
)

; plan
1. (op_5 obj_06 obj_08)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_08)
   goals met: 0 of 1
2. (op_1 obj_08 obj_11)
   deleted: (pred_10 obj_11 obj_08) (pred_8)
   added: (pred_5 obj_11)
   goals met: 0 of 1
3. (op_5 obj_08 obj_06)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_06)
   goals met: 0 of 1
4. (op_5 obj_06 obj_16)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_01)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_01)
   goals met: 0 of 1
6. (op_2 obj_01 obj_11)
   deleted: (pred_5 obj_11)
   added: (pred_8) (pred_10 obj_11 obj_01)
   goals met: 1 of 1
